Challenge : Day 1

In [ ]:
%load_ext sql

Challenge: Day 1

In [5]:
%sql sqlite:///abc_data.db

In [16]:
 %%sql CREATE TABLE customer (
            customer_id integer PRIMARY KEY,
            customer_first_name varchar(100),
            customer_last_name varchar(100),
            customer_email varchar(100)
         );

 * sqlite:///abc_data.db
Done.

[]

Challenge: Day 2

In [18]:
%%sql INSERT INTO customer (customer_id, customer_first_name, customer_last_name,customer_email) VALUES
        (1, 'John', 'Doe', 'johndoe@email.com'),
        (2, 'Jane', 'Smith', 'janesmith@email.com'),
        (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
        (4, 'Alice', 'Brown', 'alicebrown@email.com'),
        (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
        (6, 'Eva', 'Fisher', 'evafisher@email.com'),
        (7, 'George', 'Harris', 'georgeharris@email.com'),
        (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
        (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
        (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
        (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
        (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
        (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///abc_data.db
13 rows affected.

[]

In [23]:
%%sql CREATE TABLE product(
            product_id integer PRIMARY KEY,
            product_name varchar(30),
            price integer(15)
         );

 * sqlite:///abc_data.db
Done.

[]

In [25]:
%%sql  INSERT INTO product (product_id, product_name, price) VALUES
        (1, 'Product A', 10.00),
        (2, 'Product B', 15.00),
        (3, 'Product C', 20.00),
        (4, 'Product D', 25.00),
        (5, 'Product E', 30.00),
        (6, 'Product F', 35.00),
        (7, 'Product G', 40.00),
        (8, 'Product H', 45.00),
        (9, 'Product I', 50.00),
        (10, 'Product J', 55.00),
        (11, 'Product K', 60.00),
        (12, 'Product L', 65.00),
        (13, 'Product M', 70.00);

 * sqlite:///abc_data.db
13 rows affected.

[]

In [26]:
%%sql CREATE TABLE orders(
    order_id interger PRIMARY KEY,
    customer_id integer (20),
    order_date integer (10)
);

 * sqlite:///abc_data.db
Done.

[]

In [27]:
%%sql INSERT INTO orders (order_id, customer_id, order_date) VALUES
        (1, 1, '2023-05-01'),
        (2, 2, '2023-05-02'),
        (3, 3, '2023-05-03'),
        (4, 1, '2023-05-04'),
        (5, 2, '2023-05-05'),
        (6, 3, '2023-05-06'),
        (7, 4, '2023-05-07'),
        (8, 5, '2023-05-08'),
        (9, 6, '2023-05-09'),
        (10, 7, '2023-05-10'),
        (11, 8, '2023-05-11'),
        (12, 9, '2023-05-12'),
        (13, 10, '2023-05-13'),
        (14, 11, '2023-05-14'),
        (15, 12, '2023-05-15'),
        (16, 13, '2023-05-16');

 * sqlite:///abc_data.db
16 rows affected.

[]

In [39]:
%%sql CREATE TABLE order_items(
    order_id interger PRIMARY KEY,
    product_id integer (20),
    quantity integer (10)
);

 * sqlite:///abc_data.db
(sqlite3.OperationalError) table order_items already exists
[SQL: CREATE TABLE order_items(
    order_id interger PRIMARY KEY,
    product_id integer (20),
    quantity integer (10)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [41]:
%%sql DROP TABLE order_items

 * sqlite:///abc_data.db
Done.

[]

In [42]:
%%sql CREATE TABLE order_items(
  order_id interger(10),
  product_id interger(10),
  quantity interger(10)
);

 * sqlite:///abc_data.db
Done.

[]

In [43]:
%%sql INSERT INTO order_items (order_id, product_id, quantity) VALUES
        (1, 1, 2),
        (1, 2, 1),
        (2, 2, 1),
        (2, 3, 3),
        (3, 1, 1),
        (3, 3, 2),
        (4, 2, 4),
        (4, 3, 1),
        (5, 1, 1),
        (5, 3, 2),
        (6, 2, 3),
        (6, 1, 1),
        (7, 4, 1),
        (7, 5, 2),
        (8, 6, 3),
        (8, 7, 1),
        (9, 8, 2),
        (9, 9, 1),
        (10, 10, 3),
        (10, 11, 2),
        (11, 12, 1),
        (11, 13, 3),
        (12, 4, 2),
        (12, 5, 1),
        (13, 6, 3),
        (13, 7, 2),
        (14, 8, 1),
        (14, 9, 2),
        (15, 10, 3),
        (15, 11, 1),
        (16, 12, 2),
        (16, 13, 3);

 * sqlite:///abc_data.db
32 rows affected.

[]